<div class="alert alert-block alert-success">
    <h1 align="center">Pandas Trick 10</h1>
    <h3 align="center">Split Columns</h3>
    <h4 align="center"><a href="http://www.iran-machinelearning.ir">Soheil Tehranipour</a></h5>
</div>

### Importing the libraries

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.5.1'

## Make Dataframe

In [8]:
df = pd.DataFrame({'Name':['Soheil TehraniPour', 'Farhad TehraniPour'], 'Location':['Tehran, Iran', 'Melbourn, Australia']})
df

                 Name             Location
0  Soheil TehraniPour         Tehran, Iran
1  Farhad TehraniPour  Melbourn, Australia

In [9]:
df[['Firstname', 'Lastname']] = df.Name.str.split(' ', expand=True)
df

                 Name             Location Firstname     Lastname
0  Soheil TehraniPour         Tehran, Iran    Soheil  TehraniPour
1  Farhad TehraniPour  Melbourn, Australia    Farhad  TehraniPour

## Alternative Solution

In [11]:
df['Firstname'], df['Lastname'], = zip(*df.Name.str.split(' '))
df

                 Name             Location Firstname     Lastname
0  Soheil TehraniPour         Tehran, Iran    Soheil  TehraniPour
1  Farhad TehraniPour  Melbourn, Australia    Farhad  TehraniPour

<img src="https://webna.ir/wp-content/uploads/2018/08/%D9%85%DA%A9%D8%AA%D8%A8-%D8%AE%D9%88%D9%86%D9%87.png" width=50% />